In [2]:
# Visual Python: Data Analysis > Import
import pandas as pd

In [4]:
# Visual Python: Data Analysis > File
df = pd.read_excel('./score.xlsx', index_col='지원번호')
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197   90   85  100  95  85      Python
2번    정대만  북산고  184   40   35   50  55  25        Java
3번    송태섭  북산고  168   80   75   70  80  75  Javascript
4번    서태웅  북산고  187   40   60   70  75  80         NaN
5번    강백호  북산고  188   15   20   10  35  10         NaN
6번    변덕규  능남고  202   80  100   95  85  80           C
7번    황태산  능남고  188   55   65   45  40  35      PYTHON
8번    윤대협  능남고  190  100   85   90  95  95          C#

In [6]:
# Visual Python: Data Analysis > Instance
df.이름

지원번호
1번    채치수
2번    정대만
3번    송태섭
4번    서태웅
5번    강백호
6번    변덕규
7번    황태산
8번    윤대협
Name: 이름, dtype: object

In [7]:
# Visual Python: Data Analysis > Subset
df[['이름','키']]

       이름    키
지원번호
1번    채치수  197
2번    정대만  184
3번    송태섭  168
4번    서태웅  187
5번    강백호  188
6번    변덕규  202
7번    황태산  188
8번    윤대협  190

In [9]:
# Visual Python: Library > columns
df.columns

Index(['이름', '학교', '키', '국어', '영어', '수학', '과학', '사회', 'SW특기'], dtype='object')

In [18]:
# Visual Python: Data Analysis > Instance

In [19]:
# Visual Python: Data Analysis > Subset
df[1:3][['이름','키']]

       이름    키
지원번호
2번    정대만  184
3번    송태섭  168

In [20]:
# Visual Python: Data Analysis > Subset
df[0:5]['이름']

지원번호
1번    채치수
2번    정대만
3번    송태섭
4번    서태웅
5번    강백호
Name: 이름, dtype: object

In [21]:
# Visual Python: Data Analysis > Subset
df[3:]

       이름   학교    키   국어   영어  수학  과학  사회    SW특기
지원번호
4번    서태웅  북산고  187   40   60  70  75  80     NaN
5번    강백호  북산고  188   15   20  10  35  10     NaN
6번    변덕규  능남고  202   80  100  95  85  80       C
7번    황태산  능남고  188   55   65  45  40  35  PYTHON
8번    윤대협  능남고  190  100   85  90  95  95      C#

In [24]:
# Visual Python: Data Analysis > Instance
df.loc[]

SyntaxError: invalid syntax (1002795151.py, line 2)

In [25]:
# Visual Python: Data Analysis > Subset
df.loc[(df.index '1번'), :]

SyntaxError: invalid syntax (3726337762.py, line 2)

In [29]:
# Visual Python: Data Analysis > Subset
df.loc['1번', :]

이름         채치수
학교         북산고
키          197
국어          90
영어          85
수학         100
과학          95
사회          85
SW특기    Python
Name: 1번, dtype: object

In [30]:
# Visual Python: Data Analysis > Subset
df.loc['5번', :]

이름      강백호
학교      북산고
키       188
국어       15
영어       20
수학       10
과학       35
사회       10
SW특기    NaN
Name: 5번, dtype: object

In [31]:
# Visual Python: Data Analysis > Subset
df.loc['1번', '국어']

90

In [32]:
# Visual Python: Data Analysis > Subset
df.loc[['1번','2번'], '영어']

지원번호
1번    85
2번    35
Name: 영어, dtype: int64

In [33]:
# Visual Python: Data Analysis > Subset
df.loc[['1번','2번'], ['영어','수학']]

      영어   수학
지원번호
1번    85  100
2번    35   50

In [34]:
# Visual Python: Data Analysis > Subset
df.loc[['1번','5번'], ['국어','사회']]

      국어  사회
지원번호
1번    90  85
5번    15  10

In [36]:
# Visual Python: Data Analysis > Subset
df.iloc[0, :]

이름         채치수
학교         북산고
키          197
국어          90
영어          85
수학         100
과학          95
사회          85
SW특기    Python
Name: 1번, dtype: object

In [35]:
# Visual Python: Data Analysis > Subset
df.loc[['1번','2번','3번','4번','5번'], ['국어','사회']]

      국어  사회
지원번호
1번    90  85
2번    40  25
3번    80  75
4번    40  80
5번    15  10

In [37]:
# Visual Python: Data Analysis > Subset
df.iloc[4, :]

이름      강백호
학교      북산고
키       188
국어       15
영어       20
수학       10
과학       35
사회       10
SW특기    NaN
Name: 5번, dtype: object

In [38]:
# Visual Python: Data Analysis > Subset
df.iloc[0, 4]

85

In [39]:
# Visual Python: Data Analysis > Subset
df.iloc[[0,1,2,3,4,5], :]

       이름   학교    키  국어   영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197  90   85  100  95  85      Python
2번    정대만  북산고  184  40   35   50  55  25        Java
3번    송태섭  북산고  168  80   75   70  80  75  Javascript
4번    서태웅  북산고  187  40   60   70  75  80         NaN
5번    강백호  북산고  188  15   20   10  35  10         NaN
6번    변덕규  능남고  202  80  100   95  85  80           C

In [40]:
# Visual Python: Data Analysis > Subset
df.iloc[0, 1]

'북산고'

In [41]:
# Visual Python: Data Analysis > Subset
df.iloc[4, 2]

188

In [42]:
# Visual Python: Data Analysis > Subset
df.iloc[[0,1], 2]

지원번호
1번    197
2번    184
Name: 키, dtype: int64

In [43]:
# Visual Python: Data Analysis > Subset
df.iloc[[0,1], [3,4]]

      국어  영어
지원번호
1번    90  85
2번    40  35

In [44]:
# Visual Python: Data Analysis > Subset
df.iloc[[0,1,3,2,4], [3,4,5,6,7,8]]

      국어  영어   수학  과학  사회        SW특기
지원번호
1번    90  85  100  95  85      Python
2번    40  35   50  55  25        Java
4번    40  60   70  75  80         NaN
3번    80  75   70  80  75  Javascript
5번    15  20   10  35  10         NaN